maemo-leste-extras/lagrange/lib/the_Foundation/src/tlsrequest.c
/** @file the_Foundation/tlsrequest.c  TLS request over a Socket (using OpenSSL)

@authors Copyright (c) 2020 Jaakko Keränen <jaakko.keranen@iki.fi>

@par License

Redistribution and use in source and binary forms, with or without
modification, are permitted provided that the following conditions are met:

1. Redistributions of source code must retain the above copyright notice, this
   list of conditions and the following disclaimer.
2. Redistributions in binary form must reproduce the above copyright notice,
   this list of conditions and the following disclaimer in the documentation
   and/or other materials provided with the distribution.

<small>THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR
ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
(INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND
ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
(INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.</small>
*/

#include "the_Foundation/tlsrequest.h"
#include "the_Foundation/buffer.h"
#include "the_Foundation/socket.h"
#include "the_Foundation/stringhash.h"
#include "the_Foundation/stringlist.h"
#include "the_Foundation/thread.h"
#include "the_Foundation/time.h"

#include <openssl/bn.h>
#include <openssl/bio.h>
#include <openssl/err.h>
#include <openssl/pem.h>
#include <openssl/rand.h>
#include <openssl/rsa.h>
#include <openssl/sha.h>
#include <openssl/ssl.h>
#include <openssl/x509v3.h>
#include <time.h>

iDeclareType(Context)

#define DEFAULT_BUF_SIZE 8192

static iContext *context_;
static iBool isPrngSeeded_;

static void initContext_(void);
static iTlsCertificate *newX509Chain_TlsCertificate_(X509 *cert, STACK_OF(X509) *chain);
static void certificateVerifyFailed_TlsRequest_(iTlsRequest *, const iTlsCertificate *cert);

static iBool readAllFromBIO_(BIO *bio, iBlock *out) {
    char buf[DEFAULT_BUF_SIZE];
    int n;
    do {
        n = BIO_read(bio, buf, sizeof(buf));
        if (n > 0) {
            appendData_Block(out, buf, n);
        }
        else if (!BIO_should_retry(bio)) {
            return iFalse;
        }
    } while (n > 0);
    return iTrue;
}

/*----------------------------------------------------------------------------------------------*/

iDeclareClass(CachedSession)

static const int maxSessionAge_CachedSession_ = 10 * 60; /* seconds */

struct Impl_CachedSession {
    iObject          object;
    iBlock           pemSession;
    iTime            timestamp;
    iTlsCertificate *cert; /* not sent if session reused */
    iBlock           clientHash;
};

static void init_CachedSession(iCachedSession *d, SSL_SESSION *sess, const iTlsCertificate *cert) {
    BIO *buf = BIO_new(BIO_s_mem());
    PEM_write_bio_SSL_SESSION(buf, sess);
    init_Block(&d->pemSession, 0);
    readAllFromBIO_(buf, &d->pemSession);
    BIO_free(buf);
    initCurrent_Time(&d->timestamp);
    d->cert = copy_TlsCertificate(cert);
    init_Block(&d->clientHash, 0);
}

static void deinit_CachedSession(iCachedSession *d) {
    deinit_Block(&d->clientHash);
    deinit_Block(&d->pemSession);
    delete_TlsCertificate(d->cert);
}

static void setClientCertificate_CachedSession_(iCachedSession *d, const iTlsCertificate *clientCert) {
    iBlock *fp = fingerprint_TlsCertificate(clientCert);
    set_Block(&d->clientHash, fp);
    delete_Block(fp);
}

iDefineClass(CachedSession)
iDefineObjectConstructionArgs(CachedSession,
                              (SSL_SESSION *sess, const iTlsCertificate *cert),
                              sess, cert)

static void reuse_CachedSession(const iCachedSession *d, SSL *ssl) {
    BIO *buf = BIO_new_mem_buf(constData_Block(&d->pemSession), (int) size_Block(&d->pemSession));
    SSL_SESSION *sess = NULL;
    PEM_read_bio_SSL_SESSION(buf, &sess, NULL, NULL);
    if (sess) {
        SSL_SESSION_up_ref(sess);
        SSL_set_session(ssl, sess);
        SSL_SESSION_free(sess);
    }
    BIO_free(buf);
}

struct Impl_Context {
    iString               libraryName;
    SSL_CTX *             ctx;
    X509_STORE *          certStore;
    iTlsRequestVerifyFunc userVerifyFunc;
    tss_t                 tssKeyCurrentRequest;
    iMutex                cacheMutex;
    iStringHash *         cache; /* key is "address:port"; these could be saved persistently */
};

static iString *cacheKey_(const iString *host, uint16_t port) {
    iString *key = copy_String(host);
    appendFormat_String(key, ":%u", port);
    return key;
}

static iBool isExpired_CachedSession_(const iCachedSession *d) {
    if (!d) return iTrue;
    return elapsedSeconds_Time(&d->timestamp) > maxSessionAge_CachedSession_;
}

static iTlsCertificate *maybeReuseSession_Context_(iContext *d, SSL *ssl, const iString *host,
                                                   uint16_t port, const iTlsCertificate *clientCert) {
    iTlsCertificate *cert = NULL;
    iBlock *clientHash = (clientCert ? fingerprint_TlsCertificate(clientCert) : new_Block(0));
    iString *key = cacheKey_(host, port);
    lock_Mutex(&d->cacheMutex);
    /* Remove old entries from the session cache. */
    iForEach(StringHash, i, d->cache) {
        iCachedSession *cs = i.value->object;
        if (isExpired_CachedSession_(cs)) {
            iDebug("[%s] session for `%s` has expired\n",
                   cstr_String(name_Thread(current_Thread())),
                   cstr_Block(&i.value->keyBlock));
            remove_StringHashIterator(&i);
        }
    }
    iCachedSession *cs = value_StringHash(d->cache, key);
    if (cs && (size_Block(&cs->clientHash) == size_Block(clientHash) &&
               cmp_Block(&cs->clientHash, clientHash) == 0)) {
        reuse_CachedSession(cs, ssl);
        cert = copy_TlsCertificate(cs->cert);
        iDebug("[%s] reusing session for `%s`\n",
               cstr_String(name_Thread(current_Thread())),
               cstr_String(key));
    }
    unlock_Mutex(&d->cacheMutex);
    delete_String(key);
    delete_Block(clientHash);
    return cert; /* caller gets ownership */
}

static void saveSession_Context_(iContext *d, const iString *host, uint16_t port,
                                 SSL_SESSION *sess, const iTlsCertificate *serverCert,
                                 const iTlsCertificate *clientCert) {
    if (sess && serverCert) {
#if defined (iHaveDebugOutput)
        const char *tname = cstr_String(name_Thread(current_Thread()));
#endif
        iDebug("[%s] saveSession: host=%s port=%u\n", tname, cstr_String(host), port);
        iString *key = cacheKey_(host, port);
        iCachedSession *cs = new_CachedSession(sess, serverCert);
        if (clientCert) {
            setClientCertificate_CachedSession_(cs, clientCert);
        }
        lock_Mutex(&d->cacheMutex);
        insert_StringHash(d->cache, key, cs);
        unlock_Mutex(&d->cacheMutex);
        iDebug("[%s] saved session for `%s`\n", tname, cstr_String(key));
        delete_String(key);
    }
}

