maemo-leste-extras/lagrange/lib/the_Foundation/src/tlsrequest.c
static iTlsRequest *currentRequestForThread_Context_(iContext *d) {
    return tss_get(context_->tssKeyCurrentRequest);
}

static void setCurrentRequestForThread_Context_(iContext *d, iTlsRequest *request) {
    tss_set(context_->tssKeyCurrentRequest, request);
}

static int verifyCallback_Context_(int preverifyOk, X509_STORE_CTX *storeCtx) {
    if (preverifyOk) {
        return 1; /* OpenSSL says it's OK */
    }
    iAssert(context_); /* must've been initialized by now */
    iContext *d     = context_;
    const int depth = X509_STORE_CTX_get_error_depth(storeCtx);
    X509 *    x509  = X509_STORE_CTX_get_current_cert(storeCtx);
    X509_up_ref(x509); /* keep a reference */
    iTlsCertificate *cert = newX509Chain_TlsCertificate_(x509, NULL);
#if 0
    /* Debugging. */ {
        X509_NAME *name = X509_get_subject_name(x509);
        printf("[TlsRequest] verifyCallback_Context: depth=%d\n", depth);
        X509_NAME_print_ex_fp(stdout, name, 0, 0);
        printf("\n");
        iBlock *fp = publicKeyFingerprint_TlsCertificate(cert);
        printf("key fp: %s\n", cstrCollect_String(hexEncode_Block(fp)));
        delete_Block(fp);
    }
#endif
    int result = 1; /* accept everything by default */
    if (d->userVerifyFunc) {
        iTlsRequest *request = currentRequestForThread_Context_(d);
        iAssert(request != NULL);
        result = d->userVerifyFunc(request, cert, depth) ? 1 : 0;
        if (!result) {
            certificateVerifyFailed_TlsRequest_(request, cert);
        }
    }
    delete_TlsCertificate(cert); /* free the reference */
    return result;
}

void init_Context(iContext *d) {
    iAssert(current_Thread() == NULL); /* must be main thread */
    init_String(&d->libraryName);
#if defined (LIBRESSL_VERSION_TEXT)
    setCStr_String(&d->libraryName, "LibreSSL");
#else
    setCStr_String(&d->libraryName, "OpenSSL");
#endif
    d->tssKeyCurrentRequest = 0;
    tss_create(&d->tssKeyCurrentRequest, NULL);
#if OPENSSL_API_COMPAT >= 0x10100000L
    OPENSSL_init_ssl(OPENSSL_INIT_LOAD_SSL_STRINGS | OPENSSL_INIT_LOAD_CRYPTO_STRINGS, NULL);
    OPENSSL_init_crypto(OPENSSL_INIT_ADD_ALL_CIPHERS | OPENSSL_INIT_ADD_ALL_DIGESTS, NULL);
    OPENSSL_init_crypto(OPENSSL_INIT_LOAD_CRYPTO_STRINGS, NULL);
#else
    SSL_library_init();
    OpenSSL_add_all_algorithms();
    SSL_load_error_strings();
    ERR_load_crypto_strings();
#endif
    ERR_load_BIO_strings();
    d->ctx = SSL_CTX_new(TLS_client_method());
    if (!d->ctx) {
        iDebug("[TlsRequest] failed to initialize OpenSSL\n");
        iAssert(d->ctx);
    }
    d->certStore = NULL;
    d->userVerifyFunc = NULL;
    SSL_CTX_set_verify(d->ctx, SSL_VERIFY_PEER, verifyCallback_Context_);
    /* Bug workarounds: https://www.openssl.org/docs/manmaster/man3/SSL_CTX_set_options.html */
    SSL_CTX_set_options(d->ctx, SSL_OP_ALL);
    SSL_CTX_set_min_proto_version(d->ctx, TLS1_2_VERSION);
    init_Mutex(&d->cacheMutex);
    d->cache = new_StringHash();
    SSL_CTX_set_session_cache_mode(d->ctx, SSL_SESS_CACHE_CLIENT | SSL_SESS_CACHE_NO_INTERNAL_STORE);
}

void deinit_Context(iContext *d) {
    iRelease(d->cache);
    deinit_Mutex(&d->cacheMutex);
    SSL_CTX_free(d->ctx);
    tss_delete(d->tssKeyCurrentRequest);
    deinit_String(&d->libraryName);
}

iBool isValid_Context(iContext *d) {
    return d->ctx != NULL;
}

/*----------------------------------------------------------------------------------------------*/

void setCACertificates_TlsRequest(const iString *caFile, const iString *caPath) {
    initContext_();
    iContext *d = context_;
    if (d->certStore) {
        X509_STORE_free(d->certStore);
    }
    d->certStore = X509_STORE_new();
    if (!X509_STORE_load_locations(d->certStore,
                                   isEmpty_String(caFile) ? NULL : cstr_String(caFile),
                                   isEmpty_String(caPath) ? NULL : cstr_String(caPath))) {
        iWarning("[TlsRequest] OpenSSL failed to load CA certificates\n");
    }
}

void setVerifyFunc_TlsRequest(iTlsRequestVerifyFunc verifyFunc) {
    initContext_();
    iContext *d = context_;
    d->userVerifyFunc = verifyFunc;
}

iDefineTypeConstruction(Context)

static void globalCleanup_TlsRequest_(void) {
#if !defined (iPlatformAndroid)
    if (context_) {
        delete_Context(context_);
    }
#endif
}

static void initContext_(void) {
    if (!context_) {
        context_ = new_Context();
        atexit(globalCleanup_TlsRequest_);
    }
}

/*----------------------------------------------------------------------------------------------*/

struct Impl_TlsCertificate {
    X509 *cert;
    STACK_OF(X509) *chain;
    EVP_PKEY *pkey;
    enum iTlsCertificateVerifyStatus *cachedVerifyStatus; /* TODO: include domain/IP check, too? */
    char fingerprint[SHA256_DIGEST_LENGTH];
};

iDefineTypeConstruction(TlsCertificate)

static void calcSHA256_(BIO *src, void *sha256_out) {
    iBlock der;
    init_Block(&der, 0);
    readAllFromBIO_(src, &der);
    SHA256(constData_Block(&der), size_Block(&der), sha256_out);
    deinit_Block(&der);
}

static void updateFingerprint_TlsCertificate_(iTlsCertificate *d) {
    if (d->cert) {
        BIO *buf = BIO_new(BIO_s_mem());
        i2d_X509_bio(buf, d->cert);
        calcSHA256_(buf, d->fingerprint);
        BIO_free(buf);
    }
    else {
        iZap(d->fingerprint);
    }
}

void init_TlsCertificate(iTlsCertificate *d) {
    initContext_();
    d->cert  = NULL;
    d->chain = NULL;
    d->pkey  = NULL;
    d->cachedVerifyStatus = malloc(sizeof(*d->cachedVerifyStatus));
    *d->cachedVerifyStatus = unknown_TlsCertificateVerifyStatus;
    iZap(d->fingerprint);
}

static void freeX509Chain_(STACK_OF(X509) *chain) {
    for (int i = 0; i < sk_X509_num(chain); i++) {
        X509_free(sk_X509_value(chain, i));
    }
    sk_X509_free(chain);
}

void deinit_TlsCertificate(iTlsCertificate *d) {
    free(d->cachedVerifyStatus);
    if (d->cert) {
        X509_free(d->cert);
    }
    if (d->chain) {
        freeX509Chain_(d->chain);
    }
    if (d->pkey) {
        EVP_PKEY_free(d->pkey);
    }
}

static iTlsCertificate *newX509Chain_TlsCertificate_(X509 *cert, STACK_OF(X509) *chain) {
    /* Note that `chain` includes `cert`; a bit redundant. However, the chain is only
       used when verifying the `cert` via OpenSSL's API. */
    iTlsCertificate *d = new_TlsCertificate();
    d->cert  = cert;
    d->chain = chain;
    updateFingerprint_TlsCertificate_(d);
    return d;
}

iTlsCertificate *newPem_TlsCertificate(const iString *pem) {
    iTlsCertificate *d = new_TlsCertificate();
    BIO *buf = BIO_new_mem_buf(cstr_String(pem), (int) size_String(pem));
    PEM_read_bio_X509(buf, &d->cert, NULL /* no passphrase callback */, "" /* empty passphrase */);
    BIO_free(buf);
    updateFingerprint_TlsCertificate_(d);
    return d;
}

iTlsCertificate *newPemKey_TlsCertificate(const iString *certPem, const iString *keyPem) {
    iTlsCertificate *d = newPem_TlsCertificate(certPem);
    BIO *buf = BIO_new_mem_buf(cstr_String(keyPem), (int) size_String(keyPem));
    PEM_read_bio_PrivateKey(buf, &d->pkey, NULL, "");
    BIO_free(buf);
    updateFingerprint_TlsCertificate_(d);
    return d;
}

static const iString *findName_(const iTlsCertificateName *names, enum iTlsCertificateNameType type) {
    for (; names->type; names++) {
        if (names->type == type) {
            return names->text;
        }
    }
    return NULL;
}

