maemo-leste-extras/lagrange/lib/the_Foundation/src/tlsrequest.c
static void add_X509Name_(X509_NAME *name, const char *id, enum iTlsCertificateNameType type,
                          const iTlsCertificateName *names) {
    const iString *str = findName_(names, type);
    if (str) {
        X509_NAME_add_entry_by_txt(
            name, id, MBSTRING_UTF8, constData_Block(&str->chars), (int) size_String(str), -1, 0);
    }
}

static void addDomain_X509Name_(X509_NAME *name, enum iTlsCertificateNameType type,
                                const iTlsCertificateName *names) {
    const iString *domain = findName_(names, type);
    if (domain) {
        const iRangecc range = range_String(domain);
        iRangecc comp = iNullRange;
        while (nextSplit_Rangecc(range, ".", &comp)) {
            X509_NAME_add_entry_by_txt(
                name, "DC", MBSTRING_UTF8, (const void *) comp.start, (int) size_Range(&comp), -1, 0);
        }
    }
}

static X509_NAME *makeX509Name_(int kindBit, const iTlsCertificateName *names) {
    X509_NAME *name = X509_NAME_new();
    add_X509Name_(name, "CN",           kindBit | commonName_TlsCertificateNameType, names);
    add_X509Name_(name, "emailAddress", kindBit | emailAddress_TlsCertificateNameType, names);
    add_X509Name_(name, "UID",          kindBit | userId_TlsCertificateNameType, names);
    addDomain_X509Name_(name,           kindBit | domain_TlsCertificateNameType, names);
    add_X509Name_(name, "OU",           kindBit | organizationalUnit_TlsCertificateNameType, names);
    add_X509Name_(name, "O",            kindBit | organization_TlsCertificateNameType, names);
    add_X509Name_(name, "C",            kindBit | country_TlsCertificateNameType, names);
    return name;
}

static void checkErrors_(void) {
    for (unsigned long err = ERR_get_error(); err; err = ERR_get_error()) {
        iDebug("[OpenSSL] %s: %s: %s\n",
               ERR_lib_error_string(err),
               ERR_func_error_string(err),
               ERR_reason_error_string(err));
    }
}

iTlsCertificate *newSelfSignedRSA_TlsCertificate(
    int rsaBits, iDate validUntil, const iTlsCertificateName *names) {
    initContext_();
    /* Seed the random number generator. */
    if (!isPrngSeeded_) {
        iTime now;
        initCurrent_Time(&now);
        RAND_seed(&now.ts.tv_nsec, sizeof(now.ts.tv_nsec));
        isPrngSeeded_ = iTrue;
    }
    RSA *rsa = RSA_new();
    BIGNUM *exponent = NULL;
    BN_asc2bn(&exponent, "65537");
    RSA_generate_key_ex(rsa, rsaBits, exponent, NULL);
    BN_free(exponent);
    iTlsCertificate *d = new_TlsCertificate();
    d->cert = X509_new();
    d->pkey = EVP_PKEY_new();
    EVP_PKEY_assign_RSA(d->pkey, rsa);
    X509_set_pubkey(d->cert, d->pkey);
#if !defined (LIBRESSL_VERSION_NUMBER) || LIBRESSL_VERSION_NUMBER < 0x3060000fL
    /* Random serial number. */ {
        BIGNUM *big = BN_new();
        if (BN_rand(big, 64, BN_RAND_TOP_ANY, BN_RAND_BOTTOM_ANY)) {
            ASN1_INTEGER *num = ASN1_INTEGER_new();
            if (num && BN_to_ASN1_INTEGER(big, num)) {
                X509_set_serialNumber(d->cert, num);
            }
            ASN1_INTEGER_free(num);
        }
        BN_free(big);
    }
#endif
    /* Set names. */ {
        X509_NAME *issuer = makeX509Name_(issuerBit_TlsCertificateNameType, names);
        X509_set_issuer_name(d->cert, issuer);
        X509_NAME_free(issuer);
        X509_NAME *subject = makeX509Name_(subjectBit_TlsCertificateNameType, names);
        X509_set_subject_name(d->cert, subject);
        X509_NAME_free(subject);
    }
    /* Valid from. */ {
        ASN1_UTCTIME *notBefore = ASN1_UTCTIME_new();
        ASN1_UTCTIME_set(notBefore, time(NULL));
        X509_set1_notBefore(d->cert, notBefore);
        ASN1_UTCTIME_free(notBefore);
    }
    /* Valid until. */ {
        ASN1_TIME *notAfter = ASN1_TIME_new();
        /* FIXME: This works correctly for UTC, but if the GMT offset is set, we assume
           it means we are defining the time in the local time zone. That may not be a
           valid assumption. */
        if (validUntil.gmtOffsetSeconds == 0) {
            ASN1_TIME_set_string(notAfter,
                                 format_CStr("%04d%02d%02d%02d%02d%02dZ",
                                             validUntil.year, validUntil.month,
                                             validUntil.day, validUntil.hour,
                                             validUntil.minute, validUntil.second));
        }
        else {
            ASN1_TIME_set(notAfter, sinceEpoch_Date(&validUntil));
        }
        X509_set1_notAfter(d->cert, notAfter);
        ASN1_TIME_free(notAfter);
    }
    X509_sign(d->cert, d->pkey, EVP_sha256());
    checkErrors_();
    updateFingerprint_TlsCertificate_(d);
    return d;
}

iTlsCertificate *copy_TlsCertificate(const iTlsCertificate *d) {
    iTlsCertificate *copy = new_TlsCertificate();
    if (d->cert) {
        X509_up_ref(d->cert);
        copy->cert = d->cert;
    }
    copy->chain = d->chain ? X509_chain_up_ref(d->chain) : NULL;
    if (d->pkey) {
        EVP_PKEY_up_ref(d->pkey);
        copy->pkey = d->pkey;
    }
    *copy->cachedVerifyStatus = *d->cachedVerifyStatus;
    memcpy(copy->fingerprint, d->fingerprint, sizeof(d->fingerprint));
    return copy;
}

iBool isEmpty_TlsCertificate(const iTlsCertificate *d) {
    return d->cert == NULL;
}

iBool hasPrivateKey_TlsCertificate(const iTlsCertificate *d) {
    return d->pkey != NULL;
}

iString *subject_TlsCertificate(const iTlsCertificate *d) {
    iString *sub = new_String();
    if (d->cert) {
        BIO *buf = BIO_new(BIO_s_mem());
        X509_NAME_print_ex(
            buf, X509_get_subject_name(d->cert), 0, XN_FLAG_ONELINE & ~ASN1_STRFLGS_ESC_MSB);
        readAllFromBIO_(buf, &sub->chars);
        BIO_free(buf);
    }
    return sub;
}

iStringList *subjectAltNames_TlsCertificate(const iTlsCertificate *d) {
    iStringList *alt = new_StringList();
    if (!d->cert) {
        return alt;
    }
    const int sanIndex = X509_get_ext_by_NID(d->cert, NID_subject_alt_name, -1);
    if (sanIndex < 0) {
        return alt;
    }
    X509_EXTENSION *sanExt = X509_get_ext(d->cert, sanIndex);
    if (!sanExt) {
        return alt;
    }
    GENERAL_NAMES *names = X509V3_EXT_d2i(sanExt);
    if (!names) {
        return alt;
    }
    iBeginCollect();
    for (int i = 0; i < sk_GENERAL_NAME_num(names); i++) {
        GENERAL_NAME *name = sk_GENERAL_NAME_value(names, i);
        switch (name->type) {
            case GEN_DNS:
                pushBackCStr_StringList(
                    alt,
                    format_CStr("DNS:%s", (const char *) ASN1_STRING_get0_data(name->d.dNSName)));
                break;
            case GEN_EMAIL:
                pushBackCStr_StringList(
                    alt,
                    format_CStr("EMAIL:%s",
                                (const char *) ASN1_STRING_get0_data(name->d.rfc822Name)));
                break;
            case GEN_IPADD: {
                uint8_t *ip = name->d.iPAddress->data;
                if (name->d.iPAddress->length == 4) {
                    pushBackCStr_StringList(
                        alt, format_CStr("IP:%d.%d.%d.%d", ip[0], ip[1], ip[2], ip[3]));
                }
                else {
                    iString *str = newCStr_String("IP");
                    for (int j = 0; j < 16; j += 2) {
                        appendFormat_String(str, ":%02x%02x", ip[j], ip[j + 1]);
                    }
                    pushBack_StringList(alt, str);
                    delete_String(str);
                }
                break;
            }
            case GEN_URI:
                pushBackCStr_StringList(alt,
                                        format_CStr("URI:%s",
                                                    (const char *) ASN1_STRING_get0_data(
                                                        name->d.uniformResourceIdentifier)));
                break;
            default:
                break;
        }
    }
    iEndCollect();
    GENERAL_NAMES_free(names);
    return alt;
}

